//Напишите программу, реализующую метод,который принимает на вход два числа (A и B) и возводит число A в натуральную степень B с использованием цикла.
//В задаче не использвать стандартный метод Pow!
//3, 5 -> 243 (3⁵)
//2, 4 -> 16


using static System.Console;
Clear();

WriteLine("Ввведиче первое число: ");
int a =int.Parse(ReadLine()!);
WriteLine("Ввведиче второе число: ");
int b =int.Parse(ReadLine()!);

int extent=1;
for(int i=0; i<b; i++)
{
    extent*=a;
}

WriteLine($"число {a} в натуральной степени {b} будет равно {extent}");
